case/j20_rhosimple_2/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//Tinlet          288.15;
Tinlet          300;
Tout            300;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $Tinlet;
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }
    
    j20
    {
        type            externalWallHeatFluxTemperature;
        mode            coefficient;
        Ta              constant 300.0;
        h               uniform 100.0;
        thicknessLayers (0.001);
        kappaLayers     (1);

        kappaMethod     fluidThermo;

        value           $internalField;

    }
}


// ************************************************************************* //
